CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Demo_Suites_V1.0.0/GD32W515P_EVAL_Demo_Suites/Projects/13_CAU/main.c
/*!
    \file    main.c
    \brief   CAU demo

    \version 2021-01-21, V1.0.0, demo for GD32W51x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32w51x.h"
#include <stdio.h>
#include "gd32w515p_eval.h"
#include "main.h"

uint8_t encrypt_result[TEXT_SIZE];
uint8_t decrypt_result[TEXT_SIZE];
uint16_t algorithm_mode_used = 0;
uint32_t i = 0;

/* DES algorithm ECB mode demo */
static void des_ecb_demo(void);
/* DES algorithm CBC mode demo */
static void des_cbc_demo(void);
/* TDES algorithm ECB mode demo */
static void tdes_ecb_demo(void);
/* TDES algorithm CBC mode demo */
static void tdes_cbc_demo(void);
/* AES algorithm ECB mode demo */
static void aes_ecb_demo(void);
/* AES algorithm CBC mode demo */
static void aes_cbc_demo(void);
/* AES algorithm CTR mode demo */
static void aes_ctr_demo(void);
/* AES algorithm GCM mode demo */
static void aes_gcm_demo(void);
/* AES algorithm CCM mode demo */
static void aes_ccm_demo(void);
/* AES algorithm CFB mode demo */
static void aes_cfb_demo(void);
/* AES algorithm OFB mode demo */
static void aes_ofb_demo(void);
/* printf data by a block of 16 bytes */
static void data_display(uint32_t datalength, uint8_t *data);
/* display algorithm selection */
static void algorithm_choose_display(void);
/* display mode selection */
static void mode_choose_display(void);
/* algorithm selection */
static void algorithm_choose(void);
/* mode selection */
static void mode_choose(void);

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    gd_eval_com_init(EVAL_COM0);

    /* enable CAU clock */
    rcu_periph_clock_enable(RCU_CAU);
  
    while(1){ 
        printf("\r\nPlain data :\r\n");
        data_display(TEXT_SIZE, plaintext);

        /* select algorithm */
        algorithm_choose_display();
        algorithm_choose();
        
        /* select mode */
        mode_choose_display();
        mode_choose();

        /* go to the corresponding encryption/decryption */
        switch(algorithm_mode_used){
        /* when DES ECB mode is selected */
        case ALGORITHM_USE_DES | MODE_USE_ECB:
            des_ecb_demo();
            break;
        /* when DES CBC mode is selected */
        case ALGORITHM_USE_DES | MODE_USE_CBC:
            des_cbc_demo();
            break;
        /* when TDES ECB mode is selected */
        case ALGORITHM_USE_TDES | MODE_USE_ECB:
            tdes_ecb_demo();
            break;
        /* when TDES CBC mode is selected */
        case ALGORITHM_USE_TDES | MODE_USE_CBC:
            tdes_cbc_demo();
            break;
        /* when AES ECB mode is selected */
        case ALGORITHM_USE_AES | MODE_USE_ECB:
            aes_ecb_demo();
            break;
        /* when AES CBC mode is selected */
        case ALGORITHM_USE_AES | MODE_USE_CBC:
            aes_cbc_demo();
            break;
        /* when AES CTR mode is selected */
        case ALGORITHM_USE_AES | MODE_USE_CTR:
            aes_ctr_demo();
            break;
        /* when AES GCM mode is selected */
        case ALGORITHM_USE_AES | MODE_USE_GCM:
            aes_gcm_demo();
            break;
        /* when AES CCM mode is selected */
        case ALGORITHM_USE_AES | MODE_USE_CCM:
            aes_ccm_demo();
            break;
        /* when AES CFB mode is selected */
        case ALGORITHM_USE_AES | MODE_USE_CFB:
            aes_cfb_demo();
            break;
        /* when AES OFB mode is selected */
        case ALGORITHM_USE_AES | MODE_USE_OFB:
            aes_ofb_demo();
            break;
        default:
            printf("algorithm or mode error! \r\n");
            break;
        }
        printf("\r\n Example restarted...\n ");
        algorithm_mode_used = 0;
    }
}

/*!
    \brief      DES algorithm ECB mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void des_ecb_demo(void)
{
    cau_parameter_struct text;

    cau_struct_para_init(&text);    
    /* encryption in DES ECB mode */
    text.alg_dir   = CAU_ENCRYPT;
    text.key       = des_key;
    text.input     = plaintext;
    text.in_length = TEXT_SIZE;    
    if(SUCCESS == cau_des_ecb(&text, encrypt_result)){
        printf(" \r\n Encrypted data with DES  Mode  ECB :\r\n\r\n");
        data_display(TEXT_SIZE, encrypt_result);      
    }
    
    /* decryption in DES ECB mode */    
    text.alg_dir   = CAU_DECRYPT;
    text.key       = des_key;
    text.input     = encrypt_result;
    text.in_length = TEXT_SIZE;       
    if(SUCCESS == cau_des_ecb(&text, decrypt_result)){
        printf(" \r\n Decrypted data with DES  Mode  ECB :\r\n\r\n");
        data_display(TEXT_SIZE, decrypt_result);
    }
}

/*!
    \brief      DES algorithm CBC mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void des_cbc_demo(void)
{
    cau_parameter_struct text;

