CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Demo_Suites_V1.0.0/GD32W515P_EVAL_Demo_Suites/Projects/13_CAU/main.c
    cau_struct_para_init(&text);    
    /* encryption in DES CBC mode */
    text.alg_dir   = CAU_ENCRYPT;
    text.key       = des_key;
    text.iv        = vectors;
    text.input     = plaintext;
    text.in_length = TEXT_SIZE;    
    if(SUCCESS == cau_des_cbc(&text, encrypt_result)){
        printf(" \r\n Encrypted data with DES  Mode  CBC :\r\n\r\n");
        data_display(TEXT_SIZE, encrypt_result);      
    }

    /* decryption in DES CBC mode */
    text.alg_dir   = CAU_DECRYPT;
    text.key       = des_key;
    text.iv        = vectors;
    text.input     = encrypt_result;
    text.in_length = TEXT_SIZE;
    if(SUCCESS == cau_des_cbc(&text, decrypt_result)){
        printf(" \r\n Decrypted data with DES  Mode  CBC :\r\n\r\n");
        data_display(TEXT_SIZE, decrypt_result);
    }    
}

/*!
    \brief      TDES algorithm ECB mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void tdes_ecb_demo(void)
{
    cau_parameter_struct text;

    cau_struct_para_init(&text);    
    /* encryption in TDES ECB mode */
    text.alg_dir   = CAU_ENCRYPT;
    text.key       = tdes_key;
    text.input     = plaintext;
    text.in_length = TEXT_SIZE;    
    if(SUCCESS == cau_tdes_ecb(&text, encrypt_result)){
        printf(" \r\n Encrypted data with TDES  Mode  ECB :\r\n\r\n");
        data_display(TEXT_SIZE, encrypt_result);      
    }

    /* decryption in TDES ECB mode */    
    text.alg_dir   = CAU_DECRYPT;
    text.key       = tdes_key;
    text.input     = encrypt_result;
    text.in_length = TEXT_SIZE;    
    if(SUCCESS == cau_tdes_ecb(&text, decrypt_result)){
        printf(" \r\n Decrypted data with TDES  Mode  ECB :\r\n\r\n");
        data_display(TEXT_SIZE, decrypt_result);
    }     
}

/*!
    \brief      TDES algorithm CBC mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void tdes_cbc_demo(void)
{
    cau_parameter_struct text;

    cau_struct_para_init(&text);    
    /* encryption in TDES CBC mode */
    text.alg_dir   = CAU_ENCRYPT;
    text.key       = tdes_key;
    text.iv        = vectors;
    text.input     = plaintext;
    text.in_length = TEXT_SIZE;      
    if(SUCCESS == cau_tdes_cbc(&text, encrypt_result)){
        printf(" \r\n Encrypted data with TDES  Mode  CBC :\r\n\r\n");
        data_display(TEXT_SIZE, encrypt_result);      
    }

    /* decryption in TDES CBC mode */    
    text.alg_dir   = CAU_DECRYPT;
    text.key       = tdes_key;
    text.iv        = vectors;
    text.input     = encrypt_result;
    text.in_length = TEXT_SIZE;    
    if(SUCCESS == cau_tdes_cbc(&text, decrypt_result)){
        printf(" \r\n Decrypted data with TDES  Mode  CBC :\r\n\r\n");
        data_display(TEXT_SIZE, decrypt_result);
    }    
}

/*!
    \brief      AES algorithm ECB mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void aes_ecb_demo(void)
{
    cau_parameter_struct text;
    uint8_t *key_addr;
    uint32_t key_size;

    cau_struct_para_init(&text);    
    /* ECB mode: AES 128 -> AES 192 -> AES 256 */
    for(i = 0; i < 3; i++){      
        /* encryption in ECB mode */
        key_addr = key_select[i];
        key_size = keysize[i];
        
        text.alg_dir   = CAU_ENCRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.input     = plaintext;
        text.in_length = TEXT_SIZE;        
        if(SUCCESS == cau_aes_ecb(&text, encrypt_result)){
            printf(" \r\n\r\nEncrypted Data with AES %d  Mode  ECB :\r\n\r\n", keysize[i]);
            data_display(TEXT_SIZE, encrypt_result);
        }        

        /* decryption in ECB mode */        
        text.alg_dir   = CAU_DECRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.input     = encrypt_result;
        text.in_length = TEXT_SIZE;         
        if(SUCCESS == cau_aes_ecb(&text, decrypt_result)){
            printf(" \r\n\r\nDecrypted Data with AES %d  Mode  ECB :\r\n\r\n", keysize[i]);
            data_display(TEXT_SIZE, decrypt_result);
        }        
    }    
}

/*!
    \brief      AES algorithm CBC mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void aes_cbc_demo(void)
{
    cau_parameter_struct text;
    uint8_t *key_addr;
    uint32_t key_size;      

    cau_struct_para_init(&text);
    /* CBC mode: AES 128 -> AES 192 -> AES 256 */
    for(i = 0; i < 3; i++){
        /* encryption in CBC mode */ 
        key_addr = key_select[i];
        key_size = keysize[i];

        text.alg_dir   = CAU_ENCRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.input     = plaintext;
        text.in_length = TEXT_SIZE;       
        if(SUCCESS == cau_aes_cbc(&text, encrypt_result)){            
            printf(" \r\n\r\nEncrypted Data with AES %d  Mode  CBC :\r\n\r\n",keysize[i] );
            data_display(TEXT_SIZE, encrypt_result);
        }        

        /* decryption in CBC mode */          
        text.alg_dir   = CAU_DECRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.input     = encrypt_result;
        text.in_length = TEXT_SIZE;           
        if(SUCCESS == cau_aes_cbc(&text, decrypt_result)){            
            printf(" \r\n\r\nDecrypted Data with AES %d  Mode  CBC :\r\n\r\n",keysize[i] );               
            data_display(TEXT_SIZE, decrypt_result);
        }
    }     
}

/*!
    \brief      AES algorithm CTR mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void aes_ctr_demo(void)
{
    cau_parameter_struct text;
    uint8_t *key_addr;
    uint32_t key_size;

    cau_struct_para_init(&text);
    /* CTR mode: AES 128 -> AES 192 -> AES 256 */
    for(i = 0; i < 3; i++){
        /* encryption in CTR mode */  
        key_addr = key_select[i];
        key_size = keysize[i];
        
        text.alg_dir   = CAU_ENCRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.input     = plaintext;
        text.in_length = TEXT_SIZE;                 
        if(SUCCESS == cau_aes_ctr(&text, encrypt_result)){            
            printf(" \r\n\r\nEncrypted Data with AES %d  Mode  CTR :\r\n\r\n",keysize[i] );
            data_display(TEXT_SIZE, encrypt_result);
        }       

        /* decryption in CTR mode */   
        text.alg_dir   = CAU_DECRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.input     = encrypt_result;
        text.in_length = TEXT_SIZE;         
        if(SUCCESS == cau_aes_ctr(&text, decrypt_result)){
            printf(" \r\n\r\nDecrypted Data with AES %d  Mode  CTR :\r\n\r\n",keysize[i] ); 
            data_display(TEXT_SIZE, decrypt_result);
        }       
    }    
}

/*!
    \brief      AES algorithm GCM mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void aes_gcm_demo(void)
{
    cau_parameter_struct text;
    uint8_t *key_addr;
    uint32_t key_size;
    uint8_t gcm_tag[GCM_TAG_SIZE];

