CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Demo_Suites_V1.0.0/GD32W515P_EVAL_Demo_Suites/Projects/13_CAU/main.c
    cau_struct_para_init(&text);
    /* GCM mode: AES 128 -> AES 192 -> AES 256 */
    for(i = 0; i < 3; i++){
        /* encryption in GCM mode */  
        key_addr = key_select[i];
        key_size = keysize[i];
        
        text.alg_dir     = CAU_ENCRYPT;
        text.key         = key_addr;
        text.key_size    = key_size;
        text.iv          = vectors;
        text.iv_size     = IV_SIZE;
        text.input       = plaintext;
        text.in_length   = TEXT_SIZE;
        text.aad         = aadmessage;
        text.aad_size    = AAD_SIZE;    
        if(SUCCESS == cau_aes_gcm(&text, encrypt_result, gcm_tag)){            
            printf(" \r\n\r\nEncrypted Data with AES %d  Mode  GCM :\r\n\r\n",keysize[i] );
            printf("encrypted data:\r\n");
            data_display(TEXT_SIZE, encrypt_result);
            printf("tag:\r\n");
            data_display(GCM_TAG_SIZE, gcm_tag);
        }       

        /* decryption in GCM mode */        
        text.alg_dir     = CAU_DECRYPT;
        text.key         = key_addr;
        text.key_size    = key_size;
        text.iv          = vectors;
        text.iv_size     = IV_SIZE;
        text.input       = encrypt_result;
        text.in_length   = TEXT_SIZE;
        text.aad         = aadmessage;
        text.aad_size    = AAD_SIZE;
        if(SUCCESS == cau_aes_gcm(&text, decrypt_result, gcm_tag)){
            printf(" \r\n\r\nDecrypted Data with AES %d  Mode  GCM :\r\n\r\n",keysize[i] ); 
            printf("decrypted data:\r\n");
            data_display(TEXT_SIZE, decrypt_result);
            printf("tag:\r\n");
            data_display(GCM_TAG_SIZE, gcm_tag);
        }       
    }    
}

/*!
    \brief      AES algorithm CCM mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void aes_ccm_demo(void)
{
    cau_parameter_struct text;
    uint8_t *key_addr;
    uint32_t key_size;
    uint8_t ccm_tag[CCM_TAG_SIZE];
    uint8_t aad_buf[AAD_SIZE + 21];  

    cau_struct_para_init(&text);
    /* CCM mode: AES 128 -> AES 192 -> AES 256 */
    for(i = 0; i < 3; i++){
        /* encryption in CCM mode */  
        key_addr = key_select[i];
        key_size = keysize[i];         

        text.alg_dir     = CAU_ENCRYPT;
        text.key         = key_addr;
        text.key_size    = key_size;
        text.iv          = ccm_vectors;
        text.iv_size     = CCM_IV_SIZE;
        text.input       = plaintext;
        text.in_length   = TEXT_SIZE;
        text.aad         = aadmessage;
        text.aad_size    = AAD_SIZE;               
        if(SUCCESS == cau_aes_ccm(&text, encrypt_result, ccm_tag, CCM_TAG_SIZE, (uint8_t *)aad_buf)){            
            printf(" \r\n\r\nEncrypted Data with AES %d  Mode  CCM :\r\n\r\n",keysize[i] );
            printf("encrypted data:\r\n");
            data_display(TEXT_SIZE, encrypt_result);
            printf("tag:\r\n");
            data_display(CCM_TAG_SIZE, ccm_tag);
        }       

        /* decryption in CCM mode */        
        text.alg_dir     = CAU_DECRYPT;
        text.key         = key_addr;
        text.key_size    = key_size;
        text.iv          = ccm_vectors;
        text.iv_size     = CCM_IV_SIZE;
        text.input       = encrypt_result;
        text.in_length   = TEXT_SIZE;
        text.aad         = aadmessage;
        text.aad_size    = AAD_SIZE;           
        if(SUCCESS == cau_aes_ccm(&text, decrypt_result, ccm_tag, CCM_TAG_SIZE, (uint8_t *)aad_buf)){
            printf(" \r\n\r\nDecrypted Data with AES %d  Mode  CCM :\r\n\r\n",keysize[i] ); 
            printf("decrypted data:\r\n");
            data_display(TEXT_SIZE, decrypt_result);
            printf("tag:\r\n");
            data_display(CCM_TAG_SIZE, ccm_tag);
        }       
    }    
}

/*!
    \brief      AES algorithm CFB mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void aes_cfb_demo(void)
{
    cau_parameter_struct text;
    uint8_t *key_addr;
    uint32_t key_size;

    cau_struct_para_init(&text);    
    /* CFB mode: AES 128 -> AES 192 -> AES 256 */
    for(i = 0; i < 3; i++){
        /* encryption in CFB mode */  
        key_addr = key_select[i];
        key_size = keysize[i];         

        text.alg_dir   = CAU_ENCRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.iv_size   = IV_SIZE;
        text.input     = plaintext;
        text.in_length = TEXT_SIZE;    
        if(SUCCESS == cau_aes_cfb(&text, encrypt_result)){            
            printf(" \r\n\r\nEncrypted Data with AES %d  Mode  CFB :\r\n\r\n",keysize[i] );
            data_display(TEXT_SIZE, encrypt_result);
        }       

        /* decryption in CFB mode */        
        text.alg_dir   = CAU_DECRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.iv_size   = IV_SIZE;
        text.input     = encrypt_result;
        text.in_length = TEXT_SIZE;    
        if(SUCCESS == cau_aes_cfb(&text,decrypt_result)){
            printf(" \r\n\r\nDecrypted Data with AES %d  Mode  CFB :\r\n\r\n",keysize[i] ); 
            data_display(TEXT_SIZE, decrypt_result);
        }       
    }    
}

/*!
    \brief      AES algorithm OFB mode demo
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void aes_ofb_demo(void)
{
    cau_parameter_struct text;
    uint8_t *key_addr;
    uint32_t key_size;

    cau_struct_para_init(&text);    
    /* OFB mode: AES 128 -> AES 192 -> AES 256 */
    for(i = 0; i < 3; i++){
        /* encryption in OFB mode */  
        key_addr = key_select[i];
        key_size = keysize[i];         

        text.alg_dir   = CAU_ENCRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.iv_size   = IV_SIZE;
        text.input     = plaintext;
        text.in_length = TEXT_SIZE;    
        if(SUCCESS == cau_aes_ofb(&text, encrypt_result)){            
            printf(" \r\n\r\nEncrypted Data with AES %d  Mode  OFB :\r\n\r\n",keysize[i] );
            data_display(TEXT_SIZE, encrypt_result);
        }       

