CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Demo_Suites_V1.0.0/GD32W515P_EVAL_Demo_Suites/Projects/13_CAU/main.c
        /* decryption in OFB mode */        
        text.alg_dir   = CAU_DECRYPT;
        text.key       = key_addr;
        text.key_size  = key_size;
        text.iv        = vectors;
        text.iv_size   = IV_SIZE;
        text.input     = encrypt_result;
        text.in_length = TEXT_SIZE;    
        if(SUCCESS == cau_aes_ofb(&text,decrypt_result)){
            printf(" \r\n\r\nDecrypted Data with AES %d  Mode  OFB :\r\n\r\n",keysize[i] ); 
            data_display(TEXT_SIZE, decrypt_result);
        }       
    }    
}

/*!
    \brief      printf data by a block of 16 bytes
    \param[in]  datalength: length of the data to display
    \param[in]  data: pointer to the data to display
    \param[out] none
    \retval     none
*/
static void data_display(uint32_t datalength, uint8_t *data)
{
    uint32_t i =0, count = 0;

    for(i = 0; i < datalength; i++){    
        printf("0x%02X ", data[i]);
        count++;
        
        /* display every 16 bytes in a block */
        if(16 == count){        
            count = 0;
            printf("  [Block %d] \r\n", i/16);
        }
    }
}

/*!
    \brief      display algorithm selection
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void algorithm_choose_display(void)
{
    printf("========Choose CAU algorithm=======\r\n");
    printf("1: DES algorithm \r\n");
    printf("2: TDES algorithm \r\n");
    printf("3: AES algorithm \r\n");
    printf("        \r\n");
}

/*!
    \brief      display mode selection
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void mode_choose_display(void)
{
    printf("========Choose CAU mode=======\r\n");
    printf("1: ECB mode \r\n");
    printf("2: CBC mode \r\n");
    printf("3: CTR mode only when choose AES algorithm  \r\n");
    printf("4: GCM mode only when choose AES algorithm  \r\n");
    printf("5: CCM mode only when choose AES algorithm  \r\n");
    printf("6: CFB mode only when choose AES algorithm  \r\n");
    printf("7: OFB mode only when choose AES algorithm  \r\n");    
    printf("        \r\n");
}

/*!
    \brief      algorithm selection
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void algorithm_choose(void)
{
    uint8_t temp; 
    uint8_t flag;
    
    flag = 1U;   
    do{
        /* wait until an algorithm is chosen */
        while(RESET == usart_flag_get(EVAL_COM0, USART_FLAG_RBNE)){
        }
        temp = usart_data_receive(EVAL_COM0);
        switch(temp){
        /* choose '1' to use DES algorithm */
        case '1':
            printf("You choose to use DES algorithm \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | ALGORITHM_USE_DES;
            break;
        /* choose '2' to use TDES algorithm */
        case '2':
            printf("You choose to use TDES algorithm \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | ALGORITHM_USE_TDES; 
            break;
        /* choose '3' to use AES algorithm */
        case '3':
            printf("You choose to use AES algorithm \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | ALGORITHM_USE_AES; 
            break;
        default:
            printf("Choose error: please choose again! \r\n");
            flag = 0U;
        }
    }while(0U == flag);
}

/*!
    \brief      mode selection
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void mode_choose(void)
{
    uint8_t temp; 
    uint8_t flag;
    
    flag = 1U;   
    do{
        /* wait until a mode is chosen */
        while(RESET == usart_flag_get(EVAL_COM0, USART_FLAG_RBNE)){
        }
        temp = usart_data_receive(EVAL_COM0);
        switch(temp){
        /* choose '1' to use ECB mode */
        case '1':
            printf("You choose to use ECB mode \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | MODE_USE_ECB; 
            break;
        /* choose '2' to use CBC mode */
        case '2':
            printf("You choose to use CBC mode \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | MODE_USE_CBC; 
            break;
        /* choose '3' to use CTR mode */
        case '3':
            printf("You choose to use CTR mode \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | MODE_USE_CTR; 
            break;
        /* choose '4' to use GCM mode */
        case '4':
            printf("You choose to use GCM mode \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | MODE_USE_GCM; 
            break;
        /* choose '5' to use CCM mode */
        case '5':
            printf("You choose to use CCM mode \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | MODE_USE_CCM; 
            break;
        /* choose '6' to use CFB mode */
        case '6':
            printf("You choose to use CFB mode \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | MODE_USE_CFB; 
            break;
        /* choose '7' to use OFB mode */
        case '7':
            printf("You choose to use OFB mode \r\n");
            flag = 1U;
            algorithm_mode_used = algorithm_mode_used | MODE_USE_OFB; 
            break;        
        default:
            printf("Choose error: please choose again! \r\n");
            flag = 0U;
        }
    }while(0U == flag);
}

/* retarget the C library printf function to the USART */
int fputc(int ch, FILE *f)
{
    usart_data_transmit(EVAL_COM0, (uint8_t)ch);
    while(RESET == usart_flag_get(EVAL_COM0, USART_FLAG_TBE));

    return ch;
}
